{
"postulates": [{"number":"1","postulate":"To draw a straight line from any point to any point.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/post1.html"},{"number":"2","postulate":"To produce a finite straight line continuously in a straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/post2.html"},{"number":"3","postulate":"To describe a circle with any center and radius.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/post3.html"},{"number":"4","postulate":"That all right angles equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/post4.html"},{"number":"5","postulate":"That, if a straight line falling on two straight lines makes the interior angles on the same side less than two right angles, the two straight lines, if produced indefinitely, meet on that side on which are the angles less than the two right angles.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/post5.html"}],
"common_notions": [{"number":"1","common_notion":"Things which equal the same thing also equal one another."},{"number":"2","common_notion":"If equals are added to equals, then the wholes are equal."},{"number":"3","common_notion":"If equals are subtracted from equals, then the remainders are equal."},{"number":"4","common_notion":"Things which coincide with one another equal one another."},{"number":"5","common_notion":"The whole is greater than the part."}],
"definitions": [{"book":"1","number":"1","definition":"A point is that which has no part.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI1.html"},{"book":"1","number":"2","definition":"A line is breadthless length.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI2.html"},{"book":"1","number":"3","definition":"The ends of a line are points.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI3.html"},{"book":"1","number":"4","definition":"A straight line is a line which lies evenly with the points on itself.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI4.html"},{"book":"1","number":"5","definition":"A surface is that which has length and breadth only.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI5.html"},{"book":"1","number":"6","definition":"The edges of a surface are lines.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI6.html"},{"book":"1","number":"7","definition":"A plane surface is a surface which lies evenly with the straight lines on itself.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI7.html"},{"book":"1","number":"8","definition":"A plane angle is the inclination to one another of two lines in a plane which meet one another and do not lie in a straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI8.html"},{"book":"1","number":"9","definition":"And when the lines containing the angle are straight, the angle is called rectilinear.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI9.html"},{"book":"1","number":"10","definition":"When a straight line standing on a straight line makes the adjacent angles equal to one another, each of the equal angles is right, and the straight line standing on the other is called a perpendicular to that on which it stands.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI10.html"},{"book":"1","number":"11","definition":"An obtuse angle is an angle greater than a right angle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI11.html"},{"book":"1","number":"12","definition":"An acute angle is an angle less than a right angle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI11.html"},{"book":"1","number":"13","definition":"A boundary is that which is an extremity of anything.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI13.html"},{"book":"1","number":"14","definition":"A figure is that which is contained by any boundary or boundaries.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI13.html"},{"book":"1","number":"15","definition":"A circle is a plane figure contained by one line such that all the straight lines falling upon it from one point among those lying within the figure equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI15.html"},{"book":"1","number":"16","definition":"And the point is called the center of the circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI15.html"},{"book":"1","number":"17","definition":"A diameter of the circle is any straight line drawn through the center and terminated in both directions by the circumference of the circle, and such a straight line also bisects the circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI15.html"},{"book":"1","number":"18","definition":"A semicircle is the figure contained by the diameter and the circumference cut off by it. And the center of the semicircle is the same as that of the circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI15.html"},{"book":"1","number":"19","definition":"Rectilinear figures are those which are contained by straight lines, trilateral figures being those contained by three, quadrilateral those contained by four, and multilateral those contained by more than four straight lines.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI19.html"},{"book":"1","number":"20","definition":"Of trilateral figures, an equilateral triangle is that which has its three sides equal, an isosceles triangle that which has two of its sides alone equal, and a scalene triangle that which has its three sides unequal.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI20.html"},{"book":"1","number":"21","definition":"Further, of trilateral figures, a right-angled triangle is that which has a right angle, an obtuse-angled triangle that which has an obtuse angle, and an acute-angled triangle that which has its three angles acute.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI20.html"},{"book":"1","number":"22","definition":"Of quadrilateral figures, a square is that which is both equilateral and right-angled; an oblong that which is right-angled but not equilateral; a rhombus that which is equilateral but not right-angled; and a rhomboid that which has its opposite sides and angles equal to one another but is neither equilateral nor right-angled. And let quadrilaterals other than these be called trapezia.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI22.html"},{"book":"1","number":"23","definition":"Parallel straight lines are straight lines which, being in the same plane and being produced indefinitely in both directions, do not meet one another in either direction.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/defI23.html"},{"book":"2","number":"1","definition":"Any rectangular parallelogram is said to be contained by the two straight lines containing the right angle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookII/defII.html"},{"book":"2","number":"2","definition":"And in any parallelogrammic area let any one whatever of the parallelograms about its diameter with the two complements be called a gnomon.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookII/defII.html"},{"book":"3","number":"1","definition":"Equal circles are those whose diameters are equal, or whose radii are equal.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/defIII1.html"},{"book":"3","number":"2","definition":"A straight line is said to touch a circle which, meeting the circle and being produced, does not cut the circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/defIII2.html"},{"book":"3","number":"3","definition":"Circles are said to touch one another which meet one another but do not cut one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/defIII2.html"},{"book":"3","number":"4","definition":"Straight lines in a circle are said to be equally distant from the center when the perpendiculars drawn to them from the center are equal.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/defIII4.html"},{"book":"3","number":"5","definition":"And that straight line is said to be at a greater distance on which the greater perpendicular falls.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/defIII4.html"},{"book":"3","number":"6","definition":"A segment of a circle is the figure contained by a straight line and a circumference of a circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/defIII6.html"},{"book":"3","number":"7","definition":"An angle of a segment is that contained by a straight line and a circumference of a circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/defIII6.html"},{"book":"3","number":"8","definition":"An angle in a segment is the angle which, when a point is taken on the circumference of the segment and straight lines are joined from it to the ends of the straight line which is the base of the segment, is contained by the straight lines so joined.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/defIII6.html"},{"book":"3","number":"9","definition":"And, when the straight lines containing the angle cut off a circumference, the angle is said to stand upon that circumference.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/defIII6.html"},{"book":"3","number":"10","definition":"A sector of a circle is the figure which, when an angle is constructed at the center of the circle, is contained by the straight lines containing the angle and the circumference cut off by them.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/defIII10.html"},{"book":"3","number":"11","definition":"Similar segments of circles are those which admit equal angles, or in which the angles equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/defIII11.html"},{"book":"4","number":"1","definition":"A rectilinear figure is said to be inscribed in a rectilinear figure when the respective angles of the inscribed figure lie on the respective sides of that in which it is inscribed.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/defIV.html"},{"book":"4","number":"2","definition":"Similarly a figure is said to be circumscribed about a figure when the respective sides of the circumscribed figure pass through the respective angles of that about which it is circumscribed.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/defIV.html"},{"book":"4","number":"3","definition":"A rectilinear figure is said to be inscribed in a circle when each angle of the inscribed figure lies on the circumference of the circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/defIV.html"},{"book":"4","number":"4","definition":"A rectilinear figure is said to be circumscribed about a circle when each side of the circumscribed figure touches the circumference of the circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/defIV.html"},{"book":"4","number":"5","definition":"Similarly a circle is said to be inscribed in a figure when the circumference of the circle touches each side of the figure in which it is inscribed.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/defIV.html"},{"book":"4","number":"6","definition":"A circle is said to be circumscribed about a figure when the circumference of the circle passes through each angle of the figure about which it is circumscribed.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/defIV.html"},{"book":"4","number":"7","definition":"A straight line is said to be fitted into a circle when its ends are on the circumference of the circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/defIV.html"},{"book":"5","number":"1","definition":"A magnitude is a part of a magnitude, the less of the greater, when it measures the greater.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV1.html"},{"book":"5","number":"2","definition":"The greater is a multiple of the less when it is measured by the less.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV1.html"},{"book":"5","number":"3","definition":"A ratio is a sort of relation in respect of size between two magnitudes of the same kind.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV3.html"},{"book":"5","number":"4","definition":"Magnitudes are said to have a ratio to one another which can, when multiplied, exceed one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV4.html"},{"book":"5","number":"5","definition":"Magnitudes are said to be in the same ratio, the first to the second and the third to the fourth, when, if any equimultiples whatever are taken of the first and third, and any equimultiples whatever of the second and fourth, the former equimultiples alike exceed, are alike equal to, or alike fall short of, the latter equimultiples respectively taken in corresponding order.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV5.html"},{"book":"5","number":"6","definition":"Let magnitudes which have the same ratio be called proportional.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV5.html"},{"book":"5","number":"7","definition":"When, of the equimultiples, the multiple of the first magnitude exceeds the multiple of the second, but the multiple of the third does not exceed the multiple of the fourth, then the first is said to have a greater ratio to the second than the third has to the fourth.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV7.html"},{"book":"5","number":"8","definition":"A proportion in three terms is the least possible.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV8.html"},{"book":"5","number":"9","definition":"When three magnitudes are proportional, the first is said to have to the third the duplicate ratio of that which it has to the second.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV8.html"},{"book":"5","number":"10","definition":"When four magnitudes are continuously proportional, the first is said to have to the fourth the triplicate ratio of that which it has to the second, and so on continually, whatever be the proportion.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV8.html"},{"book":"5","number":"11","definition":"Antecedents are said to correspond to antecedents, and consequents to consequents.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV11.html"},{"book":"5","number":"12","definition":"Alternate ratio means taking the antecedent in relation to the antecedent and the consequent in relation to the consequent.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV11.html"},{"book":"5","number":"13","definition":"Inverse ratio means taking the consequent as antecedent in relation to the antecedent as consequent.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV11.html"},{"book":"5","number":"14","definition":"A ratio taken jointly means taking the antecedent together with the consequent as one in relation to the consequent by itself.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV14.html"},{"book":"5","number":"15","definition":"A ratio taken separately means taking the excess by which the antecedent exceeds the consequent in relation to the consequent by itself.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV14.html"},{"book":"5","number":"16","definition":"Conversion of a ratio means taking the antecedent in relation to the excess by which the antecedent exceeds the consequent.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV14.html"},{"book":"5","number":"17","definition":"A ratio ex aequali arises when, there being several magnitudes and another set equal to them in multitude which taken two and two are in the same proportion, the first is to the last among the first magnitudes as the first is to the last among the second magnitudes. Or, in other words, it means taking the extreme terms by virtue of the removal of the intermediate terms.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV17.html"},{"book":"5","number":"18","definition":"A perturbed proportion arises when, there being three magnitudes and another set equal to them in multitude, antecedent is to consequent among the first magnitudes as antecedent is to consequent among the second magnitudes, while, the consequent is to a third among the first magnitudes as a third is to the antecedent among the second magnitudes.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/defV17.html"},{"book":"6","number":"1","definition":"Similar rectilinear figures are such as have their angles severally equal and the sides about the equal angles proportional.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/defVI1.html"},{"book":"6","number":"2","definition":"Two figures are reciprocally related when the sides about corresponding angles are reciprocally proportional.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/defVI2.html"},{"book":"6","number":"3","definition":"A straight line is said to have been cut in extreme and mean ratio when, as the whole line is to the greater segment, so is the greater to the less.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/defVI3.html"},{"book":"6","number":"4","definition":"The height of any figure is the perpendicular drawn from the vertex to the base.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/defVI4.html"},{"book":"7","number":"1","definition":"A unit is that by virtue of which each of the things that exist is called one.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII1.html"},{"book":"7","number":"2","definition":"A number is a multitude composed of units.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII1.html"},{"book":"7","number":"3","definition":"A number is a part of a number, the less of the greater, when it measures the greater;","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII3.html"},{"book":"7","number":"4","definition":"But parts when it does not measure it.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII3.html"},{"book":"7","number":"5","definition":"The greater number is a multiple of the less when it is measured by the less.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII3.html"},{"book":"7","number":"6","definition":"An even number is that which is divisible into two equal parts.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII6.html"},{"book":"7","number":"7","definition":"An odd number is that which is not divisible into two equal parts, or that which differs by a unit from an even number.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII6.html"},{"book":"7","number":"8","definition":"An even-times-even number is that which is measured by an even number according to an even number.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII6.html"},{"book":"7","number":"9","definition":"An even-times-odd number is that which is measured by an even number according to an odd number.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII6.html"},{"book":"7","number":"10","definition":"An odd-times-odd number is that which is measured by an odd number according to an odd number.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII6.html"},{"book":"7","number":"11","definition":"A prime number is that which is measured by a unit alone.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII11.html"},{"book":"7","number":"12","definition":"Numbers relatively prime are those which are measured by a unit alone as a common measure.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII11.html"},{"book":"7","number":"13","definition":"A composite number is that which is measured by some number.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII11.html"},{"book":"7","number":"14","definition":"Numbers relatively composite are those which are measured by some number as a common measure.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII11.html"},{"book":"7","number":"15","definition":"A number is said to multiply a number when the latter is added as many times as there are units in the former.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII15.html"},{"book":"7","number":"16","definition":"And, when two numbers having multiplied one another make some number, the number so produced be called plane, and its sides are the numbers which have multiplied one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII15.html"},{"book":"7","number":"17","definition":"And, when three numbers having multiplied one another make some number, the number so produced be called solid, and its sides are the numbers which have multiplied one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII15.html"},{"book":"7","number":"18","definition":"A square number is equal multiplied by equal, or a number which is contained by two equal numbers.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII15.html"},{"book":"7","number":"19","definition":"And a cube is equal multiplied by equal and again by equal, or a number which is contained by three equal numbers.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII15.html"},{"book":"7","number":"20","definition":"Numbers are proportional when the first is the same multiple, or the same part, or the same parts, of the second that the third is of the fourth.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII20.html"},{"book":"7","number":"21","definition":"Similar plane and solid numbers are those which have their sides proportional.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII21.html"},{"book":"7","number":"22","definition":"A perfect number is that which is equal to the sum its own parts.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/defVII22.html"},{"book":"10","number":"1","definition":"Given a rational straight line and an apotome, if the square on the whole is greater than the square on the annex by the square on a straight line commensurable in length with the whole, and the whole is commensurable in length with the rational line set out, let the apotome be called a first apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/defX.I.html#1"},{"book":"10","number":"2","definition":"But if the annex is commensurable with the rational straight line set out, and the square on the whole is greater than that on the annex by the square on a straight line commensurable with the whole, let the apotome be called a second apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/defX.I.html#2"},{"book":"10","number":"3","definition":"But if neither is commensurable in length with the rational straight line set out, and the square on the whole is greater than the square on the annex by the square on a straight line commensurable with the whole, let the apotome be called a third apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/defX.I.html#3"},{"book":"10","number":"4","definition":"Again, if the square on the whole is greater than the square on the annex by the square on a straight line incommensurable with the whole, then, if the whole is commensurable in length with the rational straight line set out, let the apotome be called a fourth apotome;","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/defX.I.html#4"},{"book":"10","number":"5","definition":"If the annex be so commensurable, a fifth;","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/defX.II.html#1"},{"book":"10","number":"6","definition":"And, if neither, a sixth.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/defX.II.html#2"},{"book":"11","number":"1","definition":"A solid is that which has length, breadth, and depth.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI1.html"},{"book":"11","number":"2","definition":"A face of a solid is a surface.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI1.html"},{"book":"11","number":"3","definition":"A straight line is at right angles to a plane when it makes right angles with all the straight lines which meet it and are in the plane.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI3.html"},{"book":"11","number":"4","definition":"A plane is at right angles to a plane when the straight lines drawn in one of the planes at right angles to the intersection of the planes are at right angles to the remaining plane.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI3.html"},{"book":"11","number":"5","definition":"The inclination of a straight line to a plane is, assuming a perpendicular drawn from the end of the straight line which is elevated above the plane to the plane, and a straight line joined from the point thus arising to the end of the straight line which is in the plane, the angle contained by the straight line so drawn and the straight line standing up.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI3.html"},{"book":"11","number":"6","definition":"The inclination of a plane to a plane is the acute angle contained by the straight lines drawn at right angles to the intersection at the same point, one in each of the planes.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI6.html"},{"book":"11","number":"7","definition":"A plane is said to be similarly inclined to a plane as another is to another when the said angles of the inclinations equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI6.html"},{"book":"11","number":"8","definition":"Parallel planes are those which do not meet.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI6.html"},{"book":"11","number":"9","definition":"Similar solid figures are those contained by similar planes equal in multitude.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI9.html"},{"book":"11","number":"10","definition":"Equal and similar solid figures are those contained by similar planes equal in multitude and magnitude.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI9.html"},{"book":"11","number":"11","definition":"A solid angle is the inclination constituted by more than two lines which meet one another and are not in the same surface, towards all the lines, that is, a solid angle is that which is contained by more than two plane angles which are not in the same plane and are constructed to one point.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI11.html"},{"book":"11","number":"12","definition":"A pyramid is a solid figure contained by planes which is constructed from one plane to one point.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI12.html"},{"book":"11","number":"13","definition":"A prism is a solid figure contained by planes two of which, namely those which are opposite, are equal, similar, and parallel, while the rest are parallelograms.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI12.html"},{"book":"11","number":"14","definition":"When a semicircle with fixed diameter is carried round and restored again to the same position from which it began to be moved, the figure so comprehended is a sphere.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI14.html"},{"book":"11","number":"15","definition":"The axis of the sphere is the straight line which remains fixed and about which the semicircle is turned.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI14.html"},{"book":"11","number":"16","definition":"The center of the sphere is the same as that of the semicircle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI14.html"},{"book":"11","number":"17","definition":"A diameter of the sphere is any straight line drawn through the center and terminated in both directions by the surface of the sphere.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI14.html"},{"book":"11","number":"18","definition":"When a right triangle with one side of those about the right angle remains fixed is carried round and restored again to the same position from which it began to be moved, the figure so comprehended is a cone. And, if the straight line which remains fixed equals the remaining side about the right angle which is carried round, the cone will be right-angled; if less, obtuse-angled; and if greater, acute-angled.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI18.html"},{"book":"11","number":"19","definition":"The axis of the cone is the straight line which remains fixed and about which the triangle is turned.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI18.html"},{"book":"11","number":"20","definition":"And the base is the circle described by the straight in which is carried round.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI18.html"},{"book":"11","number":"21","definition":"When a rectangular parallelogram with one side of those about the right angle remains fixed is carried round and restored again to the same position from which it began to be moved, the figure so comprehended is a cylinder.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI21.html"},{"book":"11","number":"22","definition":"The axis of the cylinder is the straight line which remains fixed and about which the parallelogram is turned.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI21.html"},{"book":"11","number":"23","definition":"And the bases are the circles described by the two sides opposite to one another which are carried round.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI21.html"},{"book":"11","number":"24","definition":"Similar cones and cylinders are those in which the axes and the diameters of the bases are proportional.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI24.html"},{"book":"11","number":"25","definition":"A cube is a solid figure contained by six equal squares.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI25.html"},{"book":"11","number":"26","definition":"An octahedron is a solid figure contained by eight equal and equilateral triangles.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI25.html"},{"book":"11","number":"27","definition":"An icosahedron is a solid figure contained by twenty equal and equilateral triangles.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI25.html"},{"book":"11","number":"28","definition":"A dodecahedron is a solid figure contained by twelve equal, equilateral and equiangular pentagons.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/defXI25.html"}],
"propositions": [{"book":"1","number":"1","proposition":"To construct an equilateral triangle on a given finite straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI1.html"},{"book":"1","number":"2","proposition":"To place a straight line equal to a given straight line with one end at a given point.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI2.html"},{"book":"1","number":"3","proposition":"To cut off from the greater of two given unequal straight lines a straight line equal to the less.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI3.html"},{"book":"1","number":"4","proposition":"If two triangles have two sides equal to two sides respectively, and have the angles contained by the equal straight lines equal, then they also have the base equal to the base, the triangle equals the triangle, and the remaining angles equal the remaining angles respectively, namely those opposite the equal sides.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI4.html"},{"book":"1","number":"5","proposition":"In isosceles triangles the angles at the base equal one another, and, if the equal straight lines are produced further, then the angles under the base equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI5.html"},{"book":"1","number":"6","proposition":"If in a triangle two angles equal one another, then the sides opposite the equal angles also equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI6.html"},{"book":"1","number":"7","proposition":"Given two straight lines constructed from the ends of a straight line and meeting in a point, there cannot be constructed from the ends of the same straight line, and on the same side of it, two other straight lines meeting in another point and equal to the former two respectively, namely each equal to that from the same end.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI7.html"},{"book":"1","number":"8","proposition":"If two triangles have the two sides equal to two sides respectively, and also have the base equal to the base, then they also have the angles equal which are contained by the equal straight lines.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI8.html"},{"book":"1","number":"9","proposition":"To bisect a given rectilinear angle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI9.html"},{"book":"1","number":"10","proposition":"To bisect a given finite straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI10.html"},{"book":"1","number":"11","proposition":"To draw a straight line at right angles to a given straight line from a given point on it.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI11.html"},{"book":"1","number":"12","proposition":"To draw a straight line perpendicular to a given infinite straight line from a given point not on it.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI12.html"},{"book":"1","number":"13","proposition":"If a straight line stands on a straight line, then it makes either two right angles or angles whose sum equals two right angles.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI13.html"},{"book":"1","number":"14","proposition":"If with any straight line, and at a point on it, two straight lines not lying on the same side make the sum of the adjacent angles equal to two right angles, then the two straight lines are in a straight line with one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI14.html"},{"book":"1","number":"15","proposition":"If two straight lines cut one another, then they make the vertical angles equal to one another.\n\nCorollary. If two straight lines cut one another, then they will make the angles at the point of section equal to four right angles.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI15.html"},{"book":"1","number":"16","proposition":"In any triangle, if one of the sides is produced, then the exterior angle is greater than either of the interior and opposite angles.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI16.html"},{"book":"1","number":"17","proposition":"In any triangle the sum of any two angles is less than two right angles.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI17.html"},{"book":"1","number":"18","proposition":"In any triangle the angle opposite the greater side is greater.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI18.html"},{"book":"1","number":"19","proposition":"In any triangle the side opposite the greater angle is greater.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI19.html"},{"book":"1","number":"20","proposition":"In any triangle the sum of any two sides is greater than the remaining one.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI20.html"},{"book":"1","number":"21","proposition":"If from the ends of one of the sides of a triangle two straight lines are constructed meeting within the triangle, then the sum of the straight lines so constructed is less than the sum of the remaining two sides of the triangle, but the constructed straight lines contain a greater angle than the angle contained by the remaining two sides.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI21.html"},{"book":"1","number":"22","proposition":"To construct a triangle out of three straight lines which equal three given straight lines: thus it is necessary that the sum of any two of the straight lines should be greater than the remaining one.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI22.html"},{"book":"1","number":"23","proposition":"To construct a rectilinear angle equal to a given rectilinear angle on a given straight line and at a point on it.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI23.html"},{"book":"1","number":"24","proposition":"If two triangles have two sides equal to two sides respectively, but have one of the angles contained by the equal straight lines greater than the other, then they also have the base greater than the base.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI24.html"},{"book":"1","number":"25","proposition":"If two triangles have two sides equal to two sides respectively, but have the base greater than the base, then they also have the one of the angles contained by the equal straight lines greater than the other.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI25.html"},{"book":"1","number":"26","proposition":"If two triangles have two angles equal to two angles respectively, and one side equal to one side, namely, either the side adjoining the equal angles, or that opposite one of the equal angles, then the remaining sides equal the remaining sides and the remaining angle equals the remaining angle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI26.html"},{"book":"1","number":"27","proposition":"If a straight line falling on two straight lines makes the alternate angles equal to one another, then the straight lines are parallel to one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI27.html"},{"book":"1","number":"28","proposition":"If a straight line falling on two straight lines makes the exterior angle equal to the interior and opposite angle on the same side, or the sum of the interior angles on the same side equal to two right angles, then the straight lines are parallel to one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI28.html"},{"book":"1","number":"29","proposition":"A straight line falling on parallel straight lines makes the alternate angles equal to one another, the exterior angle equal to the interior and opposite angle, and the sum of the interior angles on the same side equal to two right angles.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI29.html"},{"book":"1","number":"30","proposition":"Straight lines parallel to the same straight line are also parallel to one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI30.html"},{"book":"1","number":"31","proposition":"To draw a straight line through a given point parallel to a given straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI31.html"},{"book":"1","number":"32","proposition":"In any triangle, if one of the sides is produced, then the exterior angle equals the sum of the two interior and opposite angles, and the sum of the three interior angles of the triangle equals two right angles.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI32.html"},{"book":"1","number":"33","proposition":"Straight lines which join the ends of equal and parallel straight lines in the same directions are themselves equal and parallel.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI33.html"},{"book":"1","number":"34","proposition":"In parallelogrammic areas the opposite sides and angles equal one another, and the diameter bisects the areas.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI34.html"},{"book":"1","number":"35","proposition":"Parallelograms which are on the same base and in the same parallels equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI35.html"},{"book":"1","number":"36","proposition":"Parallelograms which are on equal bases and in the same parallels equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI36.html"},{"book":"1","number":"37","proposition":"Triangles which are on the same base and in the same parallels equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI37.html"},{"book":"1","number":"38","proposition":"Triangles which are on equal bases and in the same parallels equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI38.html"},{"book":"1","number":"39","proposition":"Equal triangles which are on the same base and on the same side are also in the same parallels.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI39.html"},{"book":"1","number":"40","proposition":"Equal triangles which are on equal bases and on the same side are also in the same parallels.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI40.html"},{"book":"1","number":"41","proposition":"If a parallelogram has the same base with a triangle and is in the same parallels, then the parallelogram is double the triangle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI41.html"},{"book":"1","number":"42","proposition":"To construct a parallelogram equal to a given triangle in a given rectilinear angle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI42.html"},{"book":"1","number":"43","proposition":"In any parallelogram the complements of the parallelograms about the diameter equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI43.html"},{"book":"1","number":"44","proposition":"To a given straight line in a given rectilinear angle, to apply a parallelogram equal to a given triangle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI44.html"},{"book":"1","number":"45","proposition":"To construct a parallelogram equal to a given rectilinear figure in a given rectilinear angle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI45.html"},{"book":"1","number":"46","proposition":"To describe a square on a given straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI46.html"},{"book":"1","number":"47","proposition":"In right-angled triangles the square on the side opposite the right angle equals the sum of the squares on the sides containing the right angle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI47.html"},{"book":"1","number":"48","proposition":"If in a triangle the square on one of the sides equals the sum of the squares on the remaining two sides of the triangle, then the angle contained by the remaining two sides of the triangle is right.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookI/propI48.html"},{"book":"2","number":"1","proposition":"If there are two straight lines, and one of them is cut into any number of segments whatever, then the rectangle contained by the two straight lines equals the sum of the rectangles contained by the uncut straight line and each of the segments.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookII/propII1.html"},{"book":"2","number":"2","proposition":"If a straight line is cut at random, then the sum of the rectangles contained by the whole and each of the segments equals the square on the whole.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookII/propII2.html"},{"book":"2","number":"3","proposition":"If a straight line is cut at random, then the rectangle contained by the whole and one of the segments equals the sum of the rectangle contained by the segments and the square on the aforesaid segment.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookII/propII3.html"},{"book":"2","number":"4","proposition":"If a straight line is cut at random, the square on the whole equals the squares on the segments plus twice the rectangle contained by the segments.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookII/propII4.html"},{"book":"2","number":"5","proposition":"If a straight line is cut into equal and unequal segments, then the rectangle contained by the unequal segments of the whole together with the square on the straight line between the points of section equals the square on the half.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookII/propII5.html"},{"book":"2","number":"6","proposition":"If a straight line is bisected and a straight line is added to it in a straight line, then the rectangle contained by the whole with the added straight line and the added straight line together with the square on the half equals the square on the straight line made up of the half and the added straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookII/propII6.html"},{"book":"2","number":"7","proposition":"If a straight line is cut at random, then the sum of the square on the whole and that on one of the segments equals twice the rectangle contained by the whole and the said segment plus the square on the remaining segment.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookII/propII7.html"},{"book":"2","number":"8","proposition":"If a straight line is cut at random, then four times the rectangle contained by the whole and one of the segments plus the square on the remaining segment equals the square described on the whole and the aforesaid segment as on one straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookII/propII8.html"},{"book":"2","number":"9","proposition":"If a straight line is cut into equal and unequal segments, then the sum of the squares on the unequal segments of the whole is double the sum of the square on the half and the square on the straight line between the points of section.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookII/propII9.html"},{"book":"2","number":"10","proposition":"If a straight line is bisected, and a straight line is added to it in a straight line, then the square on the whole with the added straight line and the square on the added straight line both together are double the sum of the square on the half and the square described on the straight line made up of the half and the added straight line as on one straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookII/propII10.html"},{"book":"2","number":"11","proposition":"To cut a given straight line so that the rectangle contained by the whole and one of the segments equals the square on the remaining segment.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookII/propII11.html"},{"book":"2","number":"12","proposition":"In obtuse-angled triangles the square on the side opposite the obtuse angle is greater than the sum of the squares on the sides containing the obtuse angle by twice the rectangle contained by one of the sides about the obtuse angle, namely that on which the perpendicular falls, and the straight line cut off outside by the perpendicular towards the obtuse angle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookII/propII12.html"},{"book":"2","number":"13","proposition":"In acute-angled triangles the square on the side opposite the acute angle is less than the sum of the squares on the sides containing the acute angle by twice the rectangle contained by one of the sides about the acute angle, namely that on which the perpendicular falls, and the straight line cut off within by the perpendicular towards the acute angle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookII/propII13.html"},{"book":"2","number":"14","proposition":"To construct a square equal to a given rectilinear figure.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookII/propII14.html"},{"book":"3","number":"1","proposition":"To find the center of a given circle.\n\nCorollary. If in a circle a straight line cuts a straight line into two equal parts and at right angles, then the center of the circle lies on the cutting straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII1.html"},{"book":"3","number":"2","proposition":"If two points are taken at random on the circumference of a circle, then the straight line joining the points falls within the circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII2.html"},{"book":"3","number":"3","proposition":"If a straight line passing through the center of a circle bisects a straight line not passing through the center, then it also cuts it at right angles; and if it cuts it at right angles, then it also bisects it.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII3.html"},{"book":"3","number":"4","proposition":"If in a circle two straight lines which do not pass through the center cut one another, then they do not bisect one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII4.html"},{"book":"3","number":"5","proposition":"If two circles cut one another, then they do not have the same center.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII5.html"},{"book":"3","number":"6","proposition":"If two circles touch one another, then they do not have the same center.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII6.html"},{"book":"3","number":"7","proposition":"If on the diameter of a circle a point is taken which is not the center of the circle, and from the point straight lines fall upon the circle, then that is greatest on which passes through the center, the remainder of the same diameter is least, and of the rest the nearer to the straight line through the center is always greater than the more remote; and only two equal straight lines fall from the point on the circle, one on each side of the least straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII7.html"},{"book":"3","number":"8","proposition":"If a point is taken outside a circle and from the point straight lines are drawn through to the circle, one of which is through the center and the others are drawn at random, then, of the straight lines which fall on the concave circumference, that through the center is greatest, while of the rest the nearer to that through the center is always greater than the more remote, but, of the straight lines falling on the convex circumference, that between the point and the diameter is least, while of the rest the nearer to the least is always less than the more remote; and only two equal straight lines fall on the circle from the point, one on each side of the least.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII8.html"},{"book":"3","number":"9","proposition":"If a point is taken within a circle, and more than two equal straight lines fall from the point on the circle, then the point taken is the center of the circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII9.html"},{"book":"3","number":"10","proposition":"A circle does not cut a circle at more than two points.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII10.html"},{"book":"3","number":"11","proposition":"If two circles touch one another internally, and their centers are taken, then the straight line joining their centers, being produced, falls on the point of contact of the circles.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII11.html"},{"book":"3","number":"12","proposition":"If two circles touch one another externally, then the straight line joining their centers passes through the point of contact.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII12.html"},{"book":"3","number":"13","proposition":"A circle does not touch another circle at more than one point whether it touches it internally or externally..","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII13.html"},{"book":"3","number":"14","proposition":"Equal straight lines in a circle are equally distant from the center, and those which are equally distant from the center equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII14.html"},{"book":"3","number":"15","proposition":"Of straight lines in a circle the diameter is greatest, and of the rest the nearer to the center is always greater than the more remote.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII15.html"},{"book":"3","number":"16","proposition":"The straight line drawn at right angles to the diameter of a circle from its end will fall outside the circle, and into the space between the straight line and the circumference another straight line cannot be interposed, further the angle of the semicircle is greater, and the remaining angle less, than any acute rectilinear angle.\n\nCorollary. From this it is manifest that the straight line drawn at right angles to the diameter of a circle from its end touches the circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII16.html"},{"book":"3","number":"17","proposition":"From a given point to draw a straight line touching a given circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII17.html"},{"book":"3","number":"18","proposition":"If a straight line touches a circle, and a straight line is joined from the center to the point of contact, the straight line so joined will be perpendicular to the tangent.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII18.html"},{"book":"3","number":"19","proposition":"If a straight line touches a circle, and from the point of contact a straight line is drawn at right angles to the tangent, the center of the circle will be on the straight line so drawn.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII19.html"},{"book":"3","number":"20","proposition":"In a circle the angle at the center is double the angle at the circumference when the angles have the same circumference as base.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII20.html"},{"book":"3","number":"21","proposition":"In a circle the angles in the same segment equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII21.html"},{"book":"3","number":"22","proposition":"The sum of the opposite angles of quadrilaterals in circles equals two right angles.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII22.html"},{"book":"3","number":"23","proposition":"On the same straight line there cannot be constructed two similar and unequal segments of circles on the same side.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII23.html"},{"book":"3","number":"24","proposition":"Similar segments of circles on equal straight lines equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII24.html"},{"book":"3","number":"25","proposition":"Given a segment of a circle, to describe the complete circle of which it is a segment.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII25.html"},{"book":"3","number":"26","proposition":"In equal circles equal angles stand on equal circumferences whether they stand at the centers or at the circumferences.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII26.html"},{"book":"3","number":"27","proposition":"In equal circles angles standing on equal circumferences equal one another whether they stand at the centers or at the circumferences.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII27.html"},{"book":"3","number":"28","proposition":"In equal circles equal straight lines cut off equal circumferences, the greater circumference equals the greater and the less equals the less.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII28.html"},{"book":"3","number":"29","proposition":"In equal circles straight lines that cut off equal circumferences are equal.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII29.html"},{"book":"3","number":"30","proposition":"To bisect a given circumference.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII30.html"},{"book":"3","number":"31","proposition":"In a circle the angle in the semicircle is right, that in a greater segment less than a right angle, and that in a less segment greater than a right angle; further the angle of the greater segment is greater than a right angle, and the angle of the less segment is less than a right angle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII31.html"},{"book":"3","number":"32","proposition":"If a straight line touches a circle, and from the point of contact there is drawn across, in the circle, a straight line cutting the circle, then the angles which it makes with the tangent equal the angles in the alternate segments of the circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII32.html"},{"book":"3","number":"33","proposition":"On a given straight line to describe a segment of a circle admitting an angle equal to a given rectilinear angle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII33.html"},{"book":"3","number":"34","proposition":"From a given circle to cut off a segment admitting an angle equal to a given rectilinear angle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII34.html"},{"book":"3","number":"35","proposition":"If in a circle two straight lines cut one another, then the rectangle contained by the segments of the one equals the rectangle contained by the segments of the other.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII35.html"},{"book":"3","number":"36","proposition":"If a point is taken outside a circle and two straight lines fall from it on the circle, and if one of them cuts the circle and the other touches it, then the rectangle contained by the whole of the straight line which cuts the circle and the straight line intercepted on it outside between the point and the convex circumference equals the square on the tangent.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII36.html"},{"book":"3","number":"37","proposition":"If a point is taken outside a circle and from the point there fall on the circle two straight lines, if one of them cuts the circle, and the other falls on it, and if further the rectangle contained by the whole of the straight line which cuts the circle and the straight line intercepted on it outside between the point and the convex circumference equals the square on the straight line which falls on the circle, then the straight line which falls on it touches the circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIII/propIII37.html"},{"book":"4","number":"1","proposition":"To fit into a given circle a straight line equal to a given straight line which is not greater than the diameter of the circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/propIV1.html"},{"book":"4","number":"2","proposition":"To inscribe in a given circle a triangle equiangular with a given triangle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/propIV2.html"},{"book":"4","number":"3","proposition":"To circumscribe about a given circle a triangle equiangular with a given triangle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/propIV3.html"},{"book":"4","number":"4","proposition":"To inscribe a circle in a given triangle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/propIV4.html"},{"book":"4","number":"5","proposition":"To circumscribe a circle about a given triangle.\n\nCorollary. When the center of the circle falls within the triangle, the triangle is acute-angled; when the center falls on a side, the triangle is right-angled; and when the center of the circle falls outside the triangle, the triangle is obtuse-angled.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/propIV5.html"},{"book":"4","number":"6","proposition":"To inscribe a square in a given circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/propIV6.html"},{"book":"4","number":"7","proposition":"To circumscribe a square about a given circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/propIV7.html"},{"book":"4","number":"8","proposition":"To inscribe a circle in a given square.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/propIV8.html"},{"book":"4","number":"9","proposition":"To circumscribe a circle about a given square.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/propIV9.html"},{"book":"4","number":"10","proposition":"To construct an isosceles triangle having each of the angles at the base double the remaining one.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/propIV10.html"},{"book":"4","number":"11","proposition":"To inscribe an equilateral and equiangular pentagon in a given circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/propIV11.html"},{"book":"4","number":"12","proposition":"To circumscribe an equilateral and equiangular pentagon about a given circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/propIV12.html"},{"book":"4","number":"13","proposition":"To inscribe a circle in a given equilateral and equiangular pentagon.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/propIV13.html"},{"book":"4","number":"14","proposition":"To circumscribe a circle about a given equilateral and equiangular pentagon.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/propIV14.html"},{"book":"4","number":"15","proposition":"To inscribe an equilateral and equiangular hexagon in a given circle.\n\nCorollary. The side of the hexagon equals the radius of the circle.\n\nAnd, in like manner as in the case of the pentagon, if through the points of division on the circle we draw tangents to the circle, there will be circumscribed about the circle an equilateral and equiangular hexagon in conformity with what was explained in the case of the pentagon.\n\nAnd further by means similar to those explained in the case of the pentagon we can both inscribe a circle in a given hexagon and circumscribe one about it.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/propIV15.html"},{"book":"4","number":"16","proposition":"To inscribe an equilateral and equiangular fifteen-angled figure in a given circle.\n\nCorollary. And, in like manner as in the case of the pentagon, if through the points of division on the circle we draw tangents to the circle, there will be circumscribed about the circle a fifteen-angled figure which is equilateral and equiangular.\n\nAnd further, by proofs similar to those in the case of the pentagon, we can both inscribe a circle in the given fifteen-angled figure and circumscribe one about it.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIV/propIV16.html"},{"book":"5","number":"1","proposition":"If any number of magnitudes are each the same multiple of the same number of other magnitudes, then the sum is that multiple of the sum.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV1.html"},{"book":"5","number":"2","proposition":"If a first magnitude is the same multiple of a second that a third is of a fourth, and a fifth also is the same multiple of the second that a sixth is of the fourth, then the sum of the first and fifth also is the same multiple of the second that the sum of the third and sixth is of the fourth.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV2.html"},{"book":"5","number":"3","proposition":"If a first magnitude is the same multiple of a second that a third is of a fourth, and if equimultiples are taken of the first and third, then the magnitudes taken also are equimultiples respectively, the one of the second and the other of the fourth.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV3.html"},{"book":"5","number":"4","proposition":"If a first magnitude has to a second the same ratio as a third to a fourth, then any equimultiples whatever of the first and third also have the same ratio to any equimultiples whatever of the second and fourth respectively, taken in corresponding order.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV4.html"},{"book":"5","number":"5","proposition":"If a magnitude is the same multiple of a magnitude that a subtracted part is of a subtracted part, then the remainder also is the same multiple of the remainder that the whole is of the whole.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV5.html"},{"book":"5","number":"6","proposition":"If two magnitudes are equimultiples of two magnitudes, and any magnitudes subtracted from them are equimultiples of the same, then the remainders either equal the same or are equimultiples of them.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV6.html"},{"book":"5","number":"7","proposition":"Equal magnitudes have to the same the same ratio; and the same has to equal magnitudes the same ratio.\n\nCorollary If any magnitudes are proportional, then they are also proportional inversely.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV7.html"},{"book":"5","number":"8","proposition":"Of unequal magnitudes, the greater has to the same a greater ratio than the less has; and the same has to the less a greater ratio than it has to the greater.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV8.html"},{"book":"5","number":"9","proposition":"Magnitudes which have the same ratio to the same equal one another; and magnitudes to which the same has the same ratio are equal.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV9.html"},{"book":"5","number":"10","proposition":"Of magnitudes which have a ratio to the same, that which has a greater ratio is greater; and that to which the same has a greater ratio is less.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV10.html"},{"book":"5","number":"11","proposition":"Ratios which are the same with the same ratio are also the same with one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV11.html"},{"book":"5","number":"12","proposition":"If any number of magnitudes are proportional, then one of the antecedents is to one of the consequents as the sum of the antecedents is to the sum of the consequents.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV12.html"},{"book":"5","number":"13","proposition":"If a first magnitude has to a second the same ratio as a third to a fourth, and the third has to the fourth a greater ratio than a fifth has to a sixth, then the first also has to the second a greater ratio than the fifth to the sixth.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV13.html"},{"book":"5","number":"14","proposition":"If a first magnitude has to a second the same ratio as a third has to a fourth, and the first is greater than the third, then the second is also greater than the fourth; if equal, equal; and if less, less.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV14.html"},{"book":"5","number":"15","proposition":"Parts have the same ratio as their equimultiples.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV15.html"},{"book":"5","number":"16","proposition":"If four magnitudes are proportional, then they are also proportional alternately.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV16.html"},{"book":"5","number":"17","proposition":"If magnitudes are proportional taken jointly, then they are also proportional taken separately.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV17.html"},{"book":"5","number":"18","proposition":"If magnitudes are proportional taken separately, then they are also proportional taken jointly.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV18.html"},{"book":"5","number":"19","proposition":"If a whole is to a whole as a part subtracted is to a part subtracted, then the remainder is also to the remainder as the whole is to the whole.\n\nCorollary. If magnitudes are proportional taken jointly, then they are also proportional in conversion.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV19.html"},{"book":"5","number":"20","proposition":"If there are three magnitudes, and others equal to them in multitude, which taken two and two are in the same ratio, and if ex aequali the first is greater than the third, then the fourth is also greater than the sixth; if equal, equal, and; if less, less.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV20.html"},{"book":"5","number":"21","proposition":"If there are three magnitudes, and others equal to them in multitude, which taken two and two together are in the same ratio, and the proportion of them is perturbed, then, if ex aequali the first magnitude is greater than the third, then the fourth is also greater than the sixth; if equal, equal; and if less, less.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV21.html"},{"book":"5","number":"22","proposition":"If there are any number of magnitudes whatever, and others equal to them in multitude, which taken two and two together are in the same ratio, then they are also in the same ratio ex aequali.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV22.html"},{"book":"5","number":"23","proposition":"If there are three magnitudes, and others equal to them in multitude, which taken two and two together are in the same ratio, and the proportion of them be perturbed, then they are also in the same ratio ex aequali.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV23.html"},{"book":"5","number":"24","proposition":"If a first magnitude has to a second the same ratio as a third has to a fourth, and also a fifth has to the second the same ratio as a sixth to the fourth, then the sum of the first and fifth has to the second the same ratio as the sum of the third and sixth has to the fourth.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV24.html"},{"book":"5","number":"25","proposition":"If four magnitudes are proportional, then the sum of the greatest and the least is greater than the sum of the remaining two.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookV/propV25.html"},{"book":"6","number":"1","proposition":"Triangles and parallelograms which are under the same height are to one another as their bases.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI1.html"},{"book":"6","number":"2","proposition":"If a straight line is drawn parallel to one of the sides of a triangle, then it cuts the sides of the triangle proportionally; and, if the sides of the triangle are cut proportionally, then the line joining the points of section is parallel to the remaining side of the triangle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI2.html"},{"book":"6","number":"3","proposition":"If an angle of a triangle is bisected by a straight line cutting the base, then the segments of the base have the same ratio as the remaining sides of the triangle; and, if segments of the base have the same ratio as the remaining sides of the triangle, then the straight line joining the vertex to the point of section bisects the angle of the triangle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI3.html"},{"book":"6","number":"4","proposition":"In equiangular triangles the sides about the equal angles are proportional where the corresponding sides are opposite the equal angles.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI4.html"},{"book":"6","number":"5","proposition":"If two triangles have their sides proportional, then the triangles are equiangular with the equal angles opposite the corresponding sides.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI5.html"},{"book":"6","number":"6","proposition":"If two triangles have one angle equal to one angle and the sides about the equal angles proportional, then the triangles are equiangular and have those angles equal opposite the corresponding sides.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI6.html"},{"book":"6","number":"7","proposition":"If two triangles have one angle equal to one angle, the sides about other angles proportional, and the remaining angles either both less or both not less than a right angle, then the triangles are equiangular and have those angles equal the sides about which are proportional.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI7.html"},{"book":"6","number":"8","proposition":"If in a right-angled triangle a perpendicular is drawn from the right angle to the base, then the triangles adjoining the perpendicular are similar both to the whole and to one another.\n\nCorollary. If in a right-angled triangle a perpendicular is drawn from the right angle to the base, then the straight line so drawn is a mean proportional between the segments of the base.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI8.html"},{"book":"6","number":"9","proposition":"To cut off a prescribed part from a given straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI9.html"},{"book":"6","number":"10","proposition":"To cut a given uncut straight line similarly to a given cut straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI10.html"},{"book":"6","number":"11","proposition":"To find a third proportional to two given straight lines.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI11.html"},{"book":"6","number":"12","proposition":"To find a fourth proportional to three given straight lines.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI12.html"},{"book":"6","number":"13","proposition":"To find a mean proportional to two given straight lines.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI13.html"},{"book":"6","number":"14","proposition":"In equal and equiangular parallelograms the sides about the equal angles are reciprocally proportional; and equiangular parallelograms in which the sides about the equal angles are reciprocally proportional are equal.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI14.html"},{"book":"6","number":"15","proposition":"In equal triangles which have one angle equal to one angle the sides about the equal angles are reciprocally proportional; and those triangles which have one angle equal to one angle, and in which the sides about the equal angles are reciprocally proportional, are equal.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI15.html"},{"book":"6","number":"16","proposition":"If four straight lines are proportional, then the rectangle contained by the extremes equals the rectangle contained by the means; and, if the rectangle contained by the extremes equals the rectangle contained by the means, then the four straight lines are proportional.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI16.html"},{"book":"6","number":"17","proposition":"If three straight lines are proportional, then the rectangle contained by the extremes equals the square on the mean; and, if the rectangle contained by the extremes equals the square on the mean, then the three straight lines are proportional.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI17.html"},{"book":"6","number":"18","proposition":"To describe a rectilinear figure similar and similarly situated to a given rectilinear figure on a given straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI18.html"},{"book":"6","number":"19","proposition":"Similar triangles are to one another in the duplicate ratio of the corresponding sides.\n\nCorollary. If three straight lines are proportional, then the first is to the third as the figure described on the first is to that which is similar and similarly described on the second.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI19.html"},{"book":"6","number":"20","proposition":"Similar polygons are divided into similar triangles, and into triangles equal in multitude and in the same ratio as the wholes, and the polygon has to the polygon a ratio duplicate of that which the corresponding side has to the corresponding side.\n\nCorollary. Similar rectilinear figures are to one another in the duplicate ratio of the corresponding sides.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI20.html"},{"book":"6","number":"21","proposition":"Figures which are similar to the same rectilinear figure are also similar to one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI21.html"},{"book":"6","number":"22","proposition":"If four straight lines are proportional, then the rectilinear figures similar and similarly described upon them are also proportional; and, if the rectilinear figures similar and similarly described upon them are proportional, then the straight lines are themselves also proportional.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI22.html"},{"book":"6","number":"23","proposition":"Equiangular parallelograms have to one another the ratio compounded of the ratios of their sides.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI23.html"},{"book":"6","number":"24","proposition":"In any parallelogram the parallelograms about the diameter are similar both to the whole and to one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI24.html"},{"book":"6","number":"25","proposition":"To construct a figure similar to one given rectilinear figure and equal to another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI25.html"},{"book":"6","number":"26","proposition":"If from a parallelogram there is taken away a parallelogram similar and similarly situated to the whole and having a common angle with it, then it is about the same diameter with the whole.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI26.html"},{"book":"6","number":"27","proposition":"Of all the parallelograms applied to the same straight line falling short by parallelogrammic figures similar and similarly situated to that described on the half of the straight line, that parallelogram is greatest which is applied to the half of the straight line and is similar to the difference.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI27.html"},{"book":"6","number":"28","proposition":"To apply a parallelogram equal to a given rectilinear figure to a given straight line but falling short by a parallelogram similar to a given one; thus the given rectilinear figure must not be greater than the parallelogram described on the half of the straight line and similar to the given parallelogram.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI28.html"},{"book":"6","number":"29","proposition":"To apply a parallelogram equal to a given rectilinear figure to a given straight line but exceeding it by a parallelogram similar to a given one.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI29.html"},{"book":"6","number":"30","proposition":"To cut a given finite straight line in extreme and mean ratio.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI30.html"},{"book":"6","number":"31","proposition":"In right-angled triangles the figure on the side opposite the right angle equals the sum of the similar and similarly described figures on the sides containing the right angle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI31.html"},{"book":"6","number":"32","proposition":"If two triangles having two sides proportional to two sides are placed together at one angle so that their corresponding sides are also parallel, then the remaining sides of the triangles are in a straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI32.html"},{"book":"6","number":"33","proposition":"Angles in equal circles have the same ratio as the circumferences on which they stand whether they stand at the centers or at the circumferences.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVI/propVI33.html"},{"book":"7","number":"1","proposition":"When two unequal numbers are set out, and the less is continually subtracted in turn from the greater, if the number which is left never measures the one before it until a unit is left, then the original numbers are relatively prime.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII1.html"},{"book":"7","number":"2","proposition":"To find the greatest common measure of two given numbers not relatively prime.\n\nCorollary. If a number measures two numbers, then it also measures their greatest common measure.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII2.html"},{"book":"7","number":"3","proposition":"To find the greatest common measure of three given numbers not relatively prime.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII3.html"},{"book":"7","number":"4","proposition":"Any number is either a part or parts of any number, the less of the greater.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII4.html"},{"book":"7","number":"5","proposition":"If a number is part of a number, and another is the same part of another, then the sum is also the same part of the sum that the one is of the one.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII5.html"},{"book":"7","number":"6","proposition":"If a number is parts of a number, and another is the same parts of another, then the sum is also the same parts of the sum that the one is of the one.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII6.html"},{"book":"7","number":"7","proposition":"If a number is that part of a number which a subtracted number is of a subtracted number, then the remainder is also the same part of the remainder that the whole is of the whole.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII7.html"},{"book":"7","number":"8","proposition":"If a number is the same parts of a number that a subtracted number is of a subtracted number, then the remainder is also the same parts of the remainder that the whole is of the whole.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII8.html"},{"book":"7","number":"9","proposition":"If a number is a part of a number, and another is the same part of another, then alternately, whatever part or parts the first is of the third, the same part, or the same parts, the second is of the fourth.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII9.html"},{"book":"7","number":"10","proposition":"If a number is a parts of a number, and another is the same parts of another, then alternately, whatever part of parts the first is of the third, the same part, or the same parts, the second is of the fourth.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII10.html"},{"book":"7","number":"11","proposition":"If a whole is to a whole as a subtracted number is to a subtracted number, then the remainder is to the remainder as the whole is to the whole.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII11.html"},{"book":"7","number":"12","proposition":"If any number of numbers are proportional, then one of the antecedents is to one of the consequents as the sum of the antecedents is to the sum of the consequents.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII12.html"},{"book":"7","number":"13","proposition":"If four numbers are proportional, then they are also proportional alternately.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII13.html"},{"book":"7","number":"14","proposition":"If there are any number of numbers, and others equal to them in multitude, which taken two and two together are in the same ratio, then they are also in the same ratio ex aequali.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII14.html"},{"book":"7","number":"15","proposition":"If a unit number measures any number, and another number measures any other number the same number of times, then alternately, the unit measures the third number the same number of times that the second measures the fourth.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII15.html"},{"book":"7","number":"16","proposition":"If two numbers multiplied by one another make certain numbers, then the numbers so produced equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII16.html"},{"book":"7","number":"17","proposition":"If a number multiplied by two numbers makes certain numbers, then the numbers so produced have the same ratio as the numbers multiplied.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII17.html"},{"book":"7","number":"18","proposition":"If two number multiplied by any number make certain numbers, then the numbers so produced have the same ratio as the multipliers.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII18.html"},{"book":"7","number":"19","proposition":"If four numbers are proportional, then the number produced from the first and fourth equals the number produced from the second and third; and, if the number produced from the first and fourth equals that produced from the second and third, then the four numbers are proportional.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII19.html"},{"book":"7","number":"20","proposition":"The least numbers of those which have the same ratio with them measure those which have the same ratio with them the same number of times; the greater the greater; and the less the less.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII20.html"},{"book":"7","number":"21","proposition":"Numbers relatively prime are the least of those which have the same ratio with them.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII21.html"},{"book":"7","number":"22","proposition":"The least numbers of those which have the same ratio with them are relatively prime.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII22.html"},{"book":"7","number":"23","proposition":"If two numbers are relatively prime, then any number which measures one of them is relatively prime to the remaining number.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII23.html"},{"book":"7","number":"24","proposition":"If two numbers are relatively prime to any number, then their product is also relatively prime to the same.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII24.html"},{"book":"7","number":"25","proposition":"If two numbers are relatively prime, then the product of one of them with itself is relatively prime to the remaining one.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII25.html"},{"book":"7","number":"26","proposition":"If two numbers are relatively prime to two numbers, both to each, then their products are also relatively prime.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII26.html"},{"book":"7","number":"27","proposition":"If two numbers are relatively prime, and each multiplied by itself makes a certain number, then the products are relatively prime; and, if the original numbers multiplied by the products make certain numbers, then the latter are also relatively prime.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII27.html"},{"book":"7","number":"28","proposition":"If two numbers are relatively prime, then their sum is also prime to each of them; and, if the sum of two numbers is relatively prime to either of them, then the original numbers are also relatively prime.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII28.html"},{"book":"7","number":"29","proposition":"Any prime number is relatively prime to any number which it does not measure.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII29.html"},{"book":"7","number":"30","proposition":"If two numbers, multiplied by one another make some number, and any prime number measures the product, then it also measures one of the original numbers.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII30.html"},{"book":"7","number":"31","proposition":"Any composite number is measured by some prime number.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII31.html"},{"book":"7","number":"32","proposition":"Any number is either prime or is measured by some prime number.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII32.html"},{"book":"7","number":"33","proposition":"Given as many numbers as we please, to find the least of those which have the same ratio with them.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII33.html"},{"book":"7","number":"34","proposition":"To find the least number which two given numbers measure.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII34.html"},{"book":"7","number":"35","proposition":"If two numbers measure any number, then the least number measured by them also measures the same.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII35.html"},{"book":"7","number":"36","proposition":"To find the least number which three given numbers measure.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII36.html"},{"book":"7","number":"37","proposition":"If a number is measured by any number, then the number which is measured has a part called by the same name as the measuring number.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII37.html"},{"book":"7","number":"38","proposition":"If a number has any part whatever, then it is measured by a number called by the same name as the part.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII38.html"},{"book":"7","number":"39","proposition":"To find the number which is the least that has given parts.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVII/propVII39.html"},{"book":"8","number":"1","proposition":"If there are as many numbers as we please in continued proportion, and the extremes of them are relatively prime, then the numbers are the least of those which have the same ratio with them.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII1.html"},{"book":"8","number":"2","proposition":"To find as many numbers as are prescribed in continued proportion, and the least that are in a given ratio.\n\nCorollary. If three numbers in continued proportion are the least of those which have the same ratio with them, then the extremes are squares, and, if four numbers, cubes.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII2.html"},{"book":"8","number":"3","proposition":"If as many numbers as we please in continued proportion are the least of those which have the same ratio with them, then the extremes of them are relatively prime.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII3.html"},{"book":"8","number":"4","proposition":"Given as many ratios as we please in least numbers, to find numbers in continued proportion which are the least in the given ratios.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII4.html"},{"book":"8","number":"5","proposition":"Plane numbers have to one another the ratio compounded of the ratios of their sides.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII5.html"},{"book":"8","number":"6","proposition":"If there are as many numbers as we please in continued proportion, and the first does not measure the second, then neither does any other measure any other.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII6.html"},{"book":"8","number":"7","proposition":"If there are as many numbers as we please in continued proportion, and the first measures the last, then it also measures the second.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII7.html"},{"book":"8","number":"8","proposition":"If between two numbers there fall numbers in continued proportion with them, then, however many numbers fall between them in continued proportion, so many also fall in continued proportion between the numbers which have the same ratios with the original numbers.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII8.html"},{"book":"8","number":"9","proposition":"If two numbers are relatively prime, and numbers fall between them in continued proportion, then, however many numbers fall between them in continued proportion, so many also fall between each of them and a unit in continued proportion.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII9.html"},{"book":"8","number":"10","proposition":"If numbers fall between two numbers and a unit in continued proportion, then however many numbers fall between each of them and a unit in continued proportion, so many also fall between the numbers themselves in continued proportion.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII10.html"},{"book":"8","number":"11","proposition":"Between two square numbers there is one mean proportional number, and the square has to the square the duplicate ratio of that which the side has to the side.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII11.html"},{"book":"8","number":"12","proposition":"Between two cubic numbers there are two mean proportional numbers, and the cube has to the cube the triplicate ratio of that which the side has to the side.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII12.html"},{"book":"8","number":"13","proposition":"If there are as many numbers as we please in continued proportion, and each multiplied by itself makes some number, then the products are proportional; and, if the original numbers multiplied by the products make certain numbers, then the latter are also proportional.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII13.html"},{"book":"8","number":"14","proposition":"If a square measures a square, then the side also measures the side; and, if the side measures the side, then the square also measures the square.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII14.html"},{"book":"8","number":"15","proposition":"If a cubic number measures a cubic number, then the side also measures the side; and, if the side measures the side, then the cube also measures the cube.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII15.html"},{"book":"8","number":"16","proposition":"If a square does not measure a square, then neither does the side measure the side; and, if the side does not measure the side, then neither does the square measure the square.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII16.html"},{"book":"8","number":"17","proposition":"If a cubic number does not measure a cubic number, then neither does the side measure the side; and, if the side does not measure the side, then neither does the cube measure the cube.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII17.html"},{"book":"8","number":"18","proposition":"Between two similar plane numbers there is one mean proportional number, and the plane number has to the plane number the ratio duplicate of that which the corresponding side has to the corresponding side.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII18.html"},{"book":"8","number":"19","proposition":"Between two similar solid numbers there fall two mean proportional numbers, and the solid number has to the solid number the ratio triplicate of that which the corresponding side has to the corresponding side.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII19.html"},{"book":"8","number":"20","proposition":"If one mean proportional number falls between two numbers, then the numbers are similar plane numbers.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII20.html"},{"book":"8","number":"21","proposition":"If two mean proportional numbers fall between two numbers, then the numbers are similar solid numbers.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII21.html"},{"book":"8","number":"22","proposition":"If three numbers are in continued proportion, and the first is square, then the third is also square.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII22.html"},{"book":"8","number":"23","proposition":"If four numbers are in continued proportion, and the first is a cube, then the fourth is also a cube.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII23.html"},{"book":"8","number":"24","proposition":"If two numbers have to one another the ratio which a square number has to a square number, and the first is square, then the second is also a square.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII24.html"},{"book":"8","number":"25","proposition":"If two numbers have to one another the ratio which a cubic number has to a cubic number, and the first is a cube, then the second is also a cube.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII25.html"},{"book":"8","number":"26","proposition":"Similar plane numbers have to one another the ratio which a square number has to a square number.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII26.html"},{"book":"8","number":"27","proposition":"Similar solid numbers have to one another the ratio which a cubic number has to a cubic number.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookVIII/propVIII27.html"},{"book":"9","number":"1","proposition":"If two similar plane numbers multiplied by one another make some number, then the product is square.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX1.html"},{"book":"9","number":"2","proposition":"If two numbers multiplied by one another make a square number, then they are similar plane numbers.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX2.html"},{"book":"9","number":"3","proposition":"If a cubic number multiplied by itself makes some number, then the product is a cube.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX3.html"},{"book":"9","number":"4","proposition":"If a cubic number multiplied by a cubic number makes some number, then the product is a cube.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX4.html"},{"book":"9","number":"5","proposition":"If a cubic number multiplied by any number makes a cubic number, then the multiplied number is also cubic.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX5.html"},{"book":"9","number":"6","proposition":"If a number multiplied by itself makes a cubic number, then it itself is also cubic.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX6.html"},{"book":"9","number":"7","proposition":"If a composite number multiplied by any number makes some number, then the product is solid.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX7.html"},{"book":"9","number":"8","proposition":"If as many numbers as we please beginning from a unit are in continued proportion, then the third from the unit is square as are also those which successively leave out one, the fourth is cubic as are also all those which leave out two, and the seventh is at once cubic and square are also those which leave out five.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX8.html"},{"book":"9","number":"9","proposition":"If as many numbers as we please beginning from a unit are in continued proportion, and the number after the unit is square, then all the rest are also square; and if the number after the unit is cubic, then all the rest are also cubic.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX9.html"},{"book":"9","number":"10","proposition":"If as many numbers as we please beginning from a unit are in continued proportion, and the number after the unit is not square, then neither is any other square except the third from the unit and all those which leave out one; and, if the number after the unit is not cubic, then neither is any other cubic except the fourth from the unit and all those which leave out two.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX10.html"},{"book":"9","number":"11","proposition":"If as many numbers as we please beginning from a unit are in continued proportion, then the less measures the greater according to some one of the numbers which appear among the proportional numbers.\n\nCorollary. Whatever place the measuring number has, reckoned from the unit, the same place also has the number according to which it measures, reckoned from the number measured, in the direction of the number before it.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX11.html"},{"book":"9","number":"12","proposition":"If as many numbers as we please beginning from a unit are in continued proportion, then by whatever prime numbers the last is measured, the next to the unit is also measured by the same.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX12.html"},{"book":"9","number":"13","proposition":"If as many numbers as we please beginning from a unit are in continued proportion, and the number after the unit is prime, then the greatest is not measured by any except those which have a place among the proportional numbers.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX13.html"},{"book":"9","number":"14","proposition":"If a number is the least that is measured by prime numbers, then it is not measured by any other prime number except those originally measuring it.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX14.html"},{"book":"9","number":"15","proposition":"If three numbers in continued proportion are the least of those which have the same ratio with them, then the sum of any two is relatively prime to the remaining number.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX15.html"},{"book":"9","number":"16","proposition":"If two numbers are relatively prime, then the second is not to any other number as the first is to the second.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX16.html"},{"book":"9","number":"17","proposition":"If there are as many numbers as we please in continued proportion, and the extremes of them are relatively prime, then the last is not to any other number as the first is to the second.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX17.html"},{"book":"9","number":"18","proposition":"Given two numbers, to investigate whether it is possible to find a third proportional to them.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX18.html"},{"book":"9","number":"19","proposition":"Given three numbers, to investigate when it is possible to find a fourth proportional to them.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX19.html"},{"book":"9","number":"20","proposition":"Prime numbers are more than any assigned multitude of prime numbers.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX20.html"},{"book":"9","number":"21","proposition":"If as many even numbers as we please are added together, then the sum is even.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX21.html"},{"book":"9","number":"22","proposition":"If as many odd numbers as we please are added together, and their multitude is even, then the sum is even.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX22.html"},{"book":"9","number":"23","proposition":"If as many odd numbers as we please are added together, and their multitude is odd, then the sum is also odd.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX23.html"},{"book":"9","number":"24","proposition":"If an even number is subtracted from an even number, then the remainder is even.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX24.html"},{"book":"9","number":"25","proposition":"If an odd number is subtracted from an even number, then the remainder is odd.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX25.html"},{"book":"9","number":"26","proposition":"If an odd number is subtracted from an odd number, then the remainder is even.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX26.html"},{"book":"9","number":"27","proposition":"If an even number is subtracted from an odd number, then the remainder is odd.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX27.html"},{"book":"9","number":"28","proposition":"If an odd number is multiplied by an even number, then the product is even.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX28.html"},{"book":"9","number":"29","proposition":"If an odd number is multiplied by an odd number, then the product is odd.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX29.html"},{"book":"9","number":"30","proposition":"If an odd number measures an even number, then it also measures half of it.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX30.html"},{"book":"9","number":"31","proposition":"If an odd number is relatively prime to any number, then it is also relatively prime to double it.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX31.html"},{"book":"9","number":"32","proposition":"Each of the numbers which are continually doubled beginning from a dyad is even-times even only.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX32.html"},{"book":"9","number":"33","proposition":"If a number has its half odd, then it is even-times odd only.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX33.html"},{"book":"9","number":"34","proposition":"If an [even] number neither is one of those which is continually doubled from a dyad, nor has its half odd, then it is both even-times even and even-times odd.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX34.html"},{"book":"9","number":"35","proposition":"If as many numbers as we please are in continued proportion, and there is subtracted from the second and the last numbers equal to the first, then the excess of the second is to the first as the excess of the last is to the sum of all those before it.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX35.html"},{"book":"9","number":"36","proposition":"If as many numbers as we please beginning from a unit are set out continuously in double proportion until the sum of all becomes prime, and if the sum multiplied into the last makes some number, then the product is perfect.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookIX/propIX36.html"},{"book":"10","number":"1","proposition":"Two unequal magnitudes being set out, if from the greater there is subtracted a magnitude greater than its half, and from that which is left a magnitude greater than its half, and if this process is repeated continually, then there will be left some magnitude less than the lesser magnitude set out. And the theorem can similarly be proven even if the parts subtracted are halves.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX1.html"},{"book":"10","number":"2","proposition":"If, when the less of two unequal magnitudes is continually subtracted in turn from the greater that which is left never measures the one before it, then the two magnitudes are incommensurable.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX2.html"},{"book":"10","number":"3","proposition":"To find the greatest common measure of two given commensurable magnitudes.\n\nCorollary. If a magnitude measures two magnitudes, then it also measures their greatest common measure.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX3.html"},{"book":"10","number":"4","proposition":"To find the greatest common measure of three given commensurable magnitudes.\n\nCorollary. If a magnitude measures three magnitudes, then it also measures their greatest common measure. The greatest common measure can be found similarly for more magnitudes, and the corollary extended.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX4.html"},{"book":"10","number":"5","proposition":"Commensurable magnitudes have to one another the ratio which a number has to a number.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX5.html"},{"book":"10","number":"6","proposition":"If two magnitudes have to one another the ratio which a number has to a number, then the magnitudes are commensurable.\n\nCorollary.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX6.html"},{"book":"10","number":"7","proposition":"Incommensurable magnitudes do not have to one another the ratio which a number has to a number.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX7.html"},{"book":"10","number":"8","proposition":"If two magnitudes do not have to one another the ratio which a number has to a number, then the magnitudes are incommensurable.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX8.html"},{"book":"10","number":"9","proposition":"The squares on straight lines commensurable in length have to one another the ratio which a square number has to a square number; and squares which have to one another the ratio which a square number has to a square number also have their sides commensurable in length. But the squares on straight lines incommensurable in length do not have to one another the ratio which a square number has to a square number; and squares which do not have to one another the ratio which a square number has to a square number also do not have their sides commensurable in length either.\n\nCorollary. Straight lines commensurable in length are always commensurable in square also, but those commensurable in square are not always also commensurable in length.\n\nLemma. Similar plane numbers have to one another the ratio which a square number has to a square number, and if two numbers have to one another the ratio which a square number has to a square number, then they are similar plane numbers.\n\nCorollary 2. Numbers which are not similar plane numbers, that is, those which do not have their sides proportional, do not have to one another the ratio which a square number has to a square number","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX9.html"},{"book":"10","number":"10","proposition":"To find two straight lines incommensurable, the one in length only, and the other in square also, with an assigned straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX10.html"},{"book":"10","number":"11","proposition":"If four magnitudes are proportional, and the first is commensurable with the second, then the third also is commensurable with the fourth; but, if the first is incommensurable with the second, then the third also is incommensurable with the fourth.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX11.html"},{"book":"10","number":"12","proposition":"Magnitudes commensurable with the same magnitude are also commensurable with one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX12.html"},{"book":"10","number":"13","proposition":"If two magnitudes are commensurable, and one of them is incommensurable with any magnitude, then the remaining one is also incommensurable with the same.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX13.html"},{"book":"10","number":"14","proposition":"Lemma. Given two unequal straight lines, to find by what square the square on the greater is greater than the square on the less. And, given two straight lines, to find the straight line the square on which equals the sum of the squares on them.\n\nProposition 14. If four straight lines are proportional, and the square on the first is greater than the square on the second by the square on a straight line commensurable with the first, then the square on the third is also greater than the square on the fourth by the square on a third line commensurable with the third. And, if the square on the first is greater than the square on the second by the square on a straight line incommensurable with the first, then the square on the third is also greater than the square on the fourth by the square on a third line incommensurable with the third.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX14.html"},{"book":"10","number":"15","proposition":"If two commensurable magnitudes are added together, then the whole is also commensurable with each of them; and, if the whole is commensurable with one of them, then the original magnitudes are also commensurable.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX15.html"},{"book":"10","number":"16","proposition":"If two incommensurable magnitudes are added together, the sum is also incommensurable with each of them; but, if the sum is incommensurable with one of them, then the original magnitudes are also incommensurable.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX16.html"},{"book":"10","number":"17","proposition":"Lemma. If to any straight line there is applied a parallelogram but falling short by a square, then the applied parallelogram equals the rectangle contained by the segments of the straight line resulting from the application.\n\nProposition 17. If there are two unequal straight lines, and to the greater there is applied a parallelogram equal to the fourth part of the square on the less but falling short by a square, and if it divides it into parts commensurable in length, then the square on the greater is greater than the square on the less by the square on a straight line commensurable with the greater. And if the square on the greater is greater than the square on the less by the square on a straight line commensurable with the greater, and if there is applied to the greater a parallelogram equal to the fourth part of the square on the less falling short by a square, then it divides it into parts commensurable in length.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX17.html"},{"book":"10","number":"18","proposition":"If there are two unequal straight lines, and to the greater there is applied a parallelogram equal to the fourth part of the square on the less but falling short by a square, and if it divides it into incommensurable parts, then the square on the greater is greater than the square on the less by the square on a straight line incommensurable with the greater. And if the square on the greater is greater than the square on the less by the square on a straight line incommensurable with the greater, and if there is applied to the greater a parallelogram equal to the fourth part of the square on the less but falling short by a square, then it divides it into incommensurable parts.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX18.html"},{"book":"10","number":"19","proposition":"Lemma.\n\nProposition 19. The rectangle contained by rational straight lines commensurable in length is rational.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX19.html"},{"book":"10","number":"20","proposition":"If a rational area is applied to a rational straight line, then it produces as breadth a straight line rational and commensurable in length with the straight line to which it is applied.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX20.html"},{"book":"10","number":"21","proposition":"The rectangle contained by rational straight lines commensurable in square only is irrational, and the side of the square equal to it is irrational. Let the latter be called medial.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX21.html"},{"book":"10","number":"22","proposition":"Lemma. If there are two straight lines, then the first is to the second as the square on the first is to the rectangle contained by the two straight lines.\n\nProposition 22. The square on a medial straight line, if applied to a rational straight line, produces as breadth a straight line rational and incommensurable in length with that to which it is applied.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX22.html"},{"book":"10","number":"23","proposition":"A straight line commensurable with a medial straight line is medial.\n\nCorollary. An area commensurable with a medial area is medial.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX23.html"},{"book":"10","number":"24","proposition":"The rectangle contained by medial straight lines commensurable in length is medial.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX24.html"},{"book":"10","number":"25","proposition":"The rectangle contained by medial straight lines commensurable in square only is either rational or medial.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX25.html"},{"book":"10","number":"26","proposition":"A medial area does not exceed a medial area by a rational area.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX26.html"},{"book":"10","number":"27","proposition":"To find medial straight lines commensurable in square only which contain a rational rectangle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX27.html"},{"book":"10","number":"28","proposition":"To find medial straight lines commensurable in square only which contain a medial rectangle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX28.html"},{"book":"10","number":"29","proposition":"Lemma 1. To find two square numbers such that their sum is also square.\n\nLemma 2. To find two square numbers such that their sum is not square.\n\nProposition 29. To find two rational straight lines commensurable in square only such that the square on the greater is greater than the square on the less by the square on a straight line commensurable in length with the greater.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX29.html"},{"book":"10","number":"30","proposition":"To find two rational straight lines commensurable in square only such that the square on the greater is greater than the square on the less by the square on a straight line incommensurable in length with the greater.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX30.html"},{"book":"10","number":"31","proposition":"To find two medial straight lines commensurable in square only, containing a rational rectangle, such that the square on the greater is greater than the square on the less by the square on a straight line commensurable in length with the greater.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX31.html"},{"book":"10","number":"32","proposition":"To find two medial straight lines commensurable in square only, containing a medial rectangle, such that the square on the greater is greater than the square on the less by the square on a straight line commensurable with the greater.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX32.html"},{"book":"10","number":"33","proposition":"Lemma.\n\nProposition 33. To find two straight lines incommensurable in square which make the sum of the squares on them rational but the rectangle contained by them medial.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX33.html"},{"book":"10","number":"34","proposition":"To find two straight lines incommensurable in square which make the sum of the squares on them medial but the rectangle contained by them rational.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX34.html"},{"book":"10","number":"35","proposition":"To find two straight lines incommensurable in square which make the sum of the squares on them medial and the rectangle contained by them medial and moreover incommensurable with the sum of the squares on them.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX35.html"},{"book":"10","number":"36","proposition":"If two rational straight lines commensurable in square only are added together, then the whole is irrational; let it be called binomial.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX36.html"},{"book":"10","number":"37","proposition":"If two medial straight lines commensurable in square only and containing a rational rectangle are added together, the whole is irrational; let it be called the first bimedial straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX37.html"},{"book":"10","number":"38","proposition":"If two medial straight lines commensurable in square only and containing a medial rectangle are added together, then the whole is irrational; let it be called the second bimedial straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX38.html"},{"book":"10","number":"39","proposition":"If two straight lines incommensurable in square which make the sum of the squares on them rational but the rectangle contained by them medial are added together, then the whole straight line is irrational; let it be called major.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX39.html"},{"book":"10","number":"40","proposition":"If two straight lines incommensurable in square which make the sum of the squares on them medial but the rectangle contained by them rational are added together, then the whole straight line is irrational; let it be called the side of a rational plus a medial area.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX40.html"},{"book":"10","number":"41","proposition":"If two straight lines incommensurable in square which make the sum of the squares on them medial and the rectangle contained by them medial and also incommensurable with the sum of the squares on them are added together, then the whole straight line is irrational; let it be called the side of the sum of two medial areas.\n\nLemma.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX41.html"},{"book":"10","number":"42","proposition":"A binomial straight line is divided into its terms at one point only.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX42.html"},{"book":"10","number":"43","proposition":"A first bimedial straight line is divided at one and the same point only.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX43.html"},{"book":"10","number":"44","proposition":"A second bimedial straight line is divided at one point only.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX44.html"},{"book":"10","number":"45","proposition":"A major straight line is divided at one point only.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX45.html"},{"book":"10","number":"46","proposition":"The side of a rational plus a medial area is divided at one point only.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX46.html"},{"book":"10","number":"47","proposition":"The side of the sum of two medial areas is divided at one point only.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX47.html"},{"book":"10","number":"48","proposition":"To find the first binomial line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX48.html"},{"book":"10","number":"49","proposition":"To find the second binomial line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX49.html"},{"book":"10","number":"50","proposition":"To find the third binomial line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX50.html"},{"book":"10","number":"51","proposition":"To find the fourth binomial line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX51.html"},{"book":"10","number":"52","proposition":"To find the fifth binomial line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX52.html"},{"book":"10","number":"53","proposition":"To find the sixth binomial line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX53.html"},{"book":"10","number":"54","proposition":"Lemma.\n\nProposition 54. If an area is contained by a rational straight line and the first binomial, then the side of the area is the irrational straight line which is called binomial.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX54.html"},{"book":"10","number":"55","proposition":"If an area is contained by a rational straight line and the second binomial, then the side of the area is the irrational straight line which is called a first bimedial.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX55.html"},{"book":"10","number":"56","proposition":"If an area is contained by a rational straight line and the third binomial, then the side of the area is the irrational straight line called a second bimedial.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX56.html"},{"book":"10","number":"57","proposition":"If an area is contained by a rational straight line and the fourth binomial, then the side of the area is the irrational straight line called major.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX57.html"},{"book":"10","number":"58","proposition":"If an area is contained by a rational straight line and the fifth binomial, then the side of the area is the irrational straight line called the side of a rational plus a medial area.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX58.html"},{"book":"10","number":"59","proposition":"If an area is contained by a rational straight line and the sixth binomial, then the side of the area is the irrational straight line called the side of the sum of two medial areas.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX59.html"},{"book":"10","number":"60","proposition":"Lemma. If a straight line is cut into unequal parts, then the sum of the squares on the unequal parts is greater than twice the rectangle contained by the unequal parts.\n\nProposition 60. The square on the binomial straight line applied to a rational straight line produces as breadth the first binomial.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX60.html"},{"book":"10","number":"61","proposition":"The square on the first bimedial straight line applied to a rational straight line produces as breadth the second binomial.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX61.html"},{"book":"10","number":"62","proposition":"The square on the second bimedial straight line applied to a rational straight line produces as breadth the third binomial.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX62.html"},{"book":"10","number":"63","proposition":"The square on the major straight line applied to a rational straight line produces as breadth the fourth binomial.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX63.html"},{"book":"10","number":"64","proposition":"The square on the side of a rational plus a medial area applied to a rational straight line produces as breadth the fifth binomial.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX64.html"},{"book":"10","number":"65","proposition":"The square on the side of the sum of two medial areas applied to a rational straight line produces as breadth the sixth binomial.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX65.html"},{"book":"10","number":"66","proposition":"A straight line commensurable with a binomial straight line is itself also binomial and the same in order.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX66.html"},{"book":"10","number":"67","proposition":"A straight line commensurable with a bimedial straight line is itself also bimedial and the same in order.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX67.html"},{"book":"10","number":"68","proposition":"A straight line commensurable with a major straight line is itself also major.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX68.html"},{"book":"10","number":"69","proposition":"A straight line commensurable with the side of a rational plus a medial area is itself also the side of a rational plus a medial area.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX69.html"},{"book":"10","number":"70","proposition":"A straight line commensurable with the side of the sum of two medial areas is the side of the sum of two medial areas.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX70.html"},{"book":"10","number":"71","proposition":"If a rational and a medial are added together, then four irrational straight lines arise, namely a binomial or a first bimedial or a major or a side of a rational plus a medial area.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX71.html"},{"book":"10","number":"72","proposition":"If two medial areas incommensurable with one another are added together, then the remaining two irrational straight lines arise, namely either a second bimedial or a side of the sum of two medial areas.\n\nProposition. The binomial straight line and the irrational straight lines after it are neither the same with the medial nor with one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX72.html"},{"book":"10","number":"73","proposition":"If from a rational straight line there is subtracted a rational straight line commensurable with the whole in square only, then the remainder is irrational; let it be called an apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX73.html"},{"book":"10","number":"74","proposition":"If from a medial straight line there is subtracted a medial straight line which is commensurable with the whole in square only, and which contains with the whole a rational rectangle, then the remainder is irrational; let it be called first apotome of a medial straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX74.html"},{"book":"10","number":"75","proposition":"If from a medial straight line there is subtracted a medial straight line which is commensurable with the whole in square only, and which contains with the whole a medial rectangle, then the remainder is irrational; let it be called second apotome of a medial straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX75.html"},{"book":"10","number":"76","proposition":"If from a straight line there is subtracted a straight line which is incommensurable in square with the whole and which with the whole makes the sum of the squares on them added together rational, but the rectangle contained by them medial, then the remainder is irrational; let it be called minor.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX76.html"},{"book":"10","number":"77","proposition":"If from a straight line there is subtracted a straight line which is incommensurable in square with the whole, and which with the whole makes the sum of the squares on them medial but twice the rectangle contained by them rational, then the remainder is irrational; let it be called that which produces with a rational area a medial whole.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX77.html"},{"book":"10","number":"78","proposition":"If from a straight line there is subtracted a straight line which is incommensurable in square with the whole and which with the whole makes the sum of the squares on them medial, twice the rectangle contained by them medial, and further the squares on them incommensurable with twice the rectangle contained by them, then the remainder is irrational; let it be called that which produces with a medial area a medial whole.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX78.html"},{"book":"10","number":"79","proposition":"To an apotome only one rational straight line can be annexed which is commensurable with the whole in square only.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX79.html"},{"book":"10","number":"80","proposition":"To a first apotome of a medial straight line only one medial straight line can be annexed which is commensurable with the whole in square only and which contains with the whole a rational rectangle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX80.html"},{"book":"10","number":"81","proposition":"To a second apotome of a medial straight line only one medial straight line can be annexed which is commensurable with the whole in square only and which contains with the whole a medial rectangle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX81.html"},{"book":"10","number":"82","proposition":"To a minor straight line only one straight line can be annexed which is incommensurable in square with the whole and which makes, with the whole, the sum of squares on them rational but twice the rectangle contained by them medial.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX82.html"},{"book":"10","number":"83","proposition":"To a straight line which produces with a rational area a medial whole only one straight line can be annexed which is incommensurable in square with the whole straight line and which with the whole straight line makes the sum of squares on them medial but twice the rectangle contained by them rational.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX83.html"},{"book":"10","number":"84","proposition":"To a straight line which produces with a medial area a medial whole only one straight line can be annexed which is incommensurable in square with the whole straight line and which with the whole straight line makes the sum of squares on them medial and twice the rectangle contained by them both medial and also incommensurable with the sum of the squares on them.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX84.html"},{"book":"10","number":"85","proposition":"To find the first apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX85.html"},{"book":"10","number":"86","proposition":"To find the second apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX86.html"},{"book":"10","number":"87","proposition":"To find the third apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX87.html"},{"book":"10","number":"88","proposition":"To find the fourth apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX88.html"},{"book":"10","number":"89","proposition":"To find the fifth apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX89.html"},{"book":"10","number":"90","proposition":"To find the sixth apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX90.html"},{"book":"10","number":"91","proposition":"If an area is contained by a rational straight line and a first apotome, then the side of the area is an apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX91.html"},{"book":"10","number":"92","proposition":"If an area is contained by a rational straight line and a second apotome, then the side of the area is a first apotome of a medial straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX92.html"},{"book":"10","number":"93","proposition":"If an area is contained by a rational straight line and a third apotome, then the side of the area is a second apotome of a medial straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX93.html"},{"book":"10","number":"94","proposition":"If an area is contained by a rational straight line and a fourth apotome, then the side of the area is minor.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX94.html"},{"book":"10","number":"95","proposition":"If an area is contained by a rational straight line and a fifth apotome, then the side of the area is a straight line which produces with a rational area a medial whole.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX95.html"},{"book":"10","number":"96","proposition":"If an area is contained by a rational straight line and a sixth apotome, then the side of the area is a straight line which produces with a medial area a medial whole.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX96.html"},{"book":"10","number":"97","proposition":"The square on an apotome of a medial straight line applied to a rational straight line produces as breadth a first apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX97.html"},{"book":"10","number":"98","proposition":"The square on a first apotome of a medial straight line applied to a rational straight line produces as breadth a second apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX98.html"},{"book":"10","number":"99","proposition":"The square on a second apotome of a medial straight line applied to a rational straight line produces as breadth a third apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX99.html"},{"book":"10","number":"100","proposition":"The square on a minor straight line applied to a rational straight line produces as breadth a fourth apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX100.html"},{"book":"10","number":"101","proposition":"The square on the straight line which produces with a rational area a medial whole, if applied to a rational straight line, produces as breadth a fifth apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX101.html"},{"book":"10","number":"102","proposition":"The square on the straight line which produces with a medial area a medial whole, if applied to a rational straight line, produces as breadth a sixth apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX102.html"},{"book":"10","number":"103","proposition":"A straight line commensurable in length with an apotome is an apotome and the same in order.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX103.html"},{"book":"10","number":"104","proposition":"A straight line commensurable with an apotome of a medial straight line is an apotome of a medial straight line and the same in order.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX104.html"},{"book":"10","number":"105","proposition":"A straight line commensurable with a minor straight line is minor.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX105.html"},{"book":"10","number":"106","proposition":"A straight line commensurable with that which produces with a rational area a medial whole is a straight line which produces with a rational area a medial whole.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX106.html"},{"book":"10","number":"107","proposition":"A straight line commensurable with that which produces a medial area and a medial whole is itself also a straight line which produces with a medial area a medial whole.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX107.html"},{"book":"10","number":"108","proposition":"If from a rational area a medial area is subtracted, the side of the remaining area becomes one of two irrational straight lines, either an apotome or a minor straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX108.html"},{"book":"10","number":"109","proposition":"If from a medial area a rational area is subtracted, then there arise two other irrational straight lines, either a first apotome of a medial straight line or a straight line which produces with a rational area a medial whole.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX109.html"},{"book":"10","number":"110","proposition":"If from a medial area there is subtracted a medial area incommensurable with the whole, then the two remaining irrational straight lines arise, either a second apotome of a medial straight line or a straight line which produce with a medial area a medial whole.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX110.html"},{"book":"10","number":"111","proposition":"The apotome is not the same with the binomial straight line.\n\nProposition. The apotome and the irrational straight lines following it are neither the same with the medial straight line nor with one another. There are, in order, thirteen irrational straight lines in all:\n\nMedial\nBinomial\nFirst bimedial\nSecond bimedial\nMajor\nSide of a rational plus a medial area\nSide of the sum of two medial areas\nApotome\nFirst apotome of a medial straight line\nSecond apotome of a medial straight line\nMinor\nProducing with a rational area a medial whole\nProducing with a medial area a medial whole","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX111.html"},{"book":"10","number":"112","proposition":"The square on a rational straight line applied to the binomial straight line produces as breadth an apotome the terms of which are commensurable with the terms of the binomial straight line and moreover in the same ratio; and further the apotome so arising has the same order as the binomial straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX112.html"},{"book":"10","number":"113","proposition":"The square on a rational straight line, if applied to an apotome, produces as breadth the binomial straight line the terms of which are commensurable with the terms of the apotome and in the same ratio; and further the binomial so arising has the same order as the apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX113.html"},{"book":"10","number":"114","proposition":"If an area is contained by an apotome and the binomial straight line the terms of which are commensurable with the terms of the apotome and in the same ratio, then the side of the area is rational.\n\nCorollary. It is possible for a rational area to be contained by irrational straight lines.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX114.html"},{"book":"10","number":"115","proposition":"From a medial straight line there arise irrational straight lines infinite in number, and none of them is the same as any preceding.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookX/propX115.html"},{"book":"11","number":"1","proposition":"A part of a straight line cannot be in the plane of reference and a part in plane more elevated.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI1.html"},{"book":"11","number":"2","proposition":"If two straight lines cut one another, then they lie in one plane; and every triangle lies in one plane.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI2.html"},{"book":"11","number":"3","proposition":"If two planes cut one another, then their intersection is a straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI3.html"},{"book":"11","number":"4","proposition":"If a straight line is set up at right angles to two straight lines which cut one another at their common point of section, then it is also at right angles to the plane passing through them.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI4.html"},{"book":"11","number":"5","proposition":"If a straight line is set up at right angles to three straight lines which meet one another at their common point of section, then the three straight lines lie in one plane.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI5.html"},{"book":"11","number":"6","proposition":"If two straight lines are at right angles to the same plane, then the straight lines are parallel.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI6.html"},{"book":"11","number":"7","proposition":"If two straight lines are parallel and points are taken at random on each of them, then the straight line joining the points is in the same plane with the parallel straight lines.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI7.html"},{"book":"11","number":"8","proposition":"If two straight lines are parallel, and one of them is at right angles to any plane, then the remaining one is also at right angles to the same plane.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI8.html"},{"book":"11","number":"9","proposition":"Straight lines which are parallel to the same straight line but do not lie in the same plane with it are also parallel to each other.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI9.html"},{"book":"11","number":"10","proposition":"If two straight lines meeting one another are parallel to two straight lines meeting one another not in the same plane, then they contain equal angles.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI10.html"},{"book":"11","number":"11","proposition":"To draw a straight line perpendicular to a given plane from a given elevated point.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI11.html"},{"book":"11","number":"12","proposition":"To set up a straight line at right angles to a give plane from a given point in it.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI12.html"},{"book":"11","number":"13","proposition":"From the same point two straight lines cannot be set up at right angles to the same plane on the same side.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI13.html"},{"book":"11","number":"14","proposition":"Planes to which the same straight line is at right angles are parallel.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI14.html"},{"book":"11","number":"15","proposition":"If two straight lines meeting one another are parallel to two straight lines meeting one another not in the same plane, then the planes through them are parallel.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI15.html"},{"book":"11","number":"16","proposition":"If two parallel planes are cut by any plane, then their intersections are parallel.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI16.html"},{"book":"11","number":"17","proposition":"If two straight lines are cut by parallel planes, then they are cut in the same ratios.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI17.html"},{"book":"11","number":"18","proposition":"If a straight line is at right angles to any plane, then all the planes through it are also at right angles to the same plane.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI18.html"},{"book":"11","number":"19","proposition":"If two planes which cut one another are at right angles to any plane, then their intersection is also at right angles to the same plane.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI19.html"},{"book":"11","number":"20","proposition":"If a solid angle is contained by three plane angles, then the sum of any two is greater than the remaining one.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI20.html"},{"book":"11","number":"21","proposition":"Any solid angle is contained by plane angles whose sum is less than four right angles.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI21.html"},{"book":"11","number":"22","proposition":"If there are three plane angles such that the sum of any two is greater than the remaining one, and they are contained by equal straight lines, then it is possible to construct a triangle out of the straight lines joining the ends of the equal straight lines.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI22.html"},{"book":"11","number":"23","proposition":"To construct a solid angles out of three plane angles such that the sum of any two is greater than the remaining one: thus the sum of the three angles must be less than four right angles.\n\nLemma for XI.23.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI23.html"},{"book":"11","number":"24","proposition":"If a solid is contained by parallel planes, then the opposite planes in it are equal and parallelogrammic.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI24.html"},{"book":"11","number":"25","proposition":"If a parallelepipedal solid is cut by a plane parallel to the opposite planes, then the base is to the base as the solid is to the solid.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI25.html"},{"book":"11","number":"26","proposition":"To construct a solid angle equal to a given solid angle on a given straight line at a given point on it.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI26.html"},{"book":"11","number":"27","proposition":"To describe a parallelepipedal solid similar and similarly situated to a given parallelepipedal solid on a given straight line.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI27.html"},{"book":"11","number":"28","proposition":"If a parallelepipedal solid is cut by a plane through the diagonals of the opposite planes, then the solid is bisected by the plane.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI28.html"},{"book":"11","number":"29","proposition":"Parallelepipedal solids which are on the same base and of the same height, and in which the ends of their edges which stand up are on the same straight lines, equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI29.html"},{"book":"11","number":"30","proposition":"Parallelepipedal solids which are on the same base and of the same height, and in which the ends of their edges which stand up are not on the same straight lines, equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI30.html"},{"book":"11","number":"31","proposition":"Parallelepipedal solids which are on equal bases and of the same height equal one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI31.html"},{"book":"11","number":"32","proposition":"Parallelepipedal solids which are of the same height are to one another as their bases.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI32.html"},{"book":"11","number":"33","proposition":"Similar parallelepipedal solids are to one another in the triplicate ratio of their corresponding sides.\n\nCorollary. If four straight lines are continuously proportional, then the first is to the fourth as a parallelepipedal solid on the first is to the similar and similarly situated parallelepipedal solid on the second, in as much as the first has to the fourth the ratio triplicate of that which it has to the second.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI33.html"},{"book":"11","number":"34","proposition":"In equal parallelepipedal solids the bases are reciprocally proportional to the heights; and those parallelepipedal solids in which the bases are reciprocally proportional to the heights are equal.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI34.html"},{"book":"11","number":"35","proposition":"If there are two equal plane angles, and on their vertices there are set up elevated straight lines containing equal angles with the original straight lines respectively, if on the elevated straight lines points are taken at random and perpendiculars are drawn from them to the planes in which the original angles are, and if from the points so arising in the planes straight lines are joined to the vertices of the original angles, then they contain with the elevated straight lines equal angles.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI35.html"},{"book":"11","number":"36","proposition":"If three straight lines are proportional, then the parallelepipedal solid formed out of the three equals the parallelepipedal solid on the mean which is equilateral, but equiangular with the aforesaid solid.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI36.html"},{"book":"11","number":"37","proposition":"If four straight lines are proportional, then parallelepipedal solids on them which are similar and similarly described are also proportional; and, if the parallelepipedal solids on them which are similar and similarly described are proportional, then the straight lines themselves are also proportional.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI37.html"},{"book":"11","number":"38","proposition":"If the sides of the opposite planes of a cube are bisected, and the planes are carried through the points of section, then the intersection of the planes and the diameter of the cube bisect one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI38.html"},{"book":"11","number":"39","proposition":"If there are two prisms of equal height, and one has a parallelogram as base and the other a triangle, and if the parallelogram is double the triangle, then the prisms are equal.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXI/propXI39.html"},{"book":"12","number":"1","proposition":"Similar polygons inscribed in circles are to one another as the squares on their diameters.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII1.html"},{"book":"12","number":"2","proposition":"Circles are to one another as the squares on their diameters.\n\nLemma for XII.2.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII2.html"},{"book":"12","number":"3","proposition":"Any pyramid with a triangular base is divided into two pyramids equal and similar to one another, similar to the whole, and having triangular bases, and into two equal prisms, and the two prisms are greater than half of the whole pyramid.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII3.html"},{"book":"12","number":"4","proposition":"If there are two pyramids of the same height with triangular bases, and each of them is divided into two pyramids equal and similar to one another and similar to the whole, and into two equal prisms, then the base of the one pyramid is to the base of the other pyramid as all the prisms in the one pyramid are to all the prisms, being equal in multitude, in the other pyramid.\n\nLemma for XII.4.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII4.html"},{"book":"12","number":"5","proposition":"Pyramids of the same height with triangular bases are to one another as their bases.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII5.html"},{"book":"12","number":"6","proposition":"Pyramids of the same height with polygonal bases are to one another as their bases.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII6.html"},{"book":"12","number":"7","proposition":"Any prism with a triangular base is divided into three pyramids equal to one another with triangular bases.\n\nCorollary. Any pyramid is a third part of the prism with the same base and equal height.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII7.html"},{"book":"12","number":"8","proposition":"Similar pyramids with triangular bases are in triplicate ratio of their corresponding sides.\n\nCorollary. Similar pyramids with polygonal bases are also to one another in triplicate ratio of their corresponding sides.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII8.html"},{"book":"12","number":"9","proposition":"In equal pyramids with triangular bases the bases are reciprocally proportional to the heights; and those pyramids are equal in which the bases are reciprocally proportional to the heights.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII9.html"},{"book":"12","number":"10","proposition":"Any cone is a third part of the cylinder with the same base and equal height.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII10.html"},{"book":"12","number":"11","proposition":"Cones and cylinders of the same height are to one another as their bases.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII11.html"},{"book":"12","number":"12","proposition":"Similar cones and cylinders are to one another in triplicate ratio of the diameters of their bases.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII12.html"},{"book":"12","number":"13","proposition":"If a cylinder is cut by a plane parallel to its opposite planes, then the cylinder is to the cylinder as the axis is to the axis.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII13.html"},{"book":"12","number":"14","proposition":"Cones and cylinders on equal bases are to one another as their heights.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII14.html"},{"book":"12","number":"15","proposition":"In equal cones and cylinders the bases are reciprocally proportional to the heights; and those cones and cylinders in which the bases are reciprocally proportional to the heights are equal.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII15.html"},{"book":"12","number":"16","proposition":"Given two circles about the same center, to inscribe in the greater circle an equilateral polygon with an even number of sides which does not touch the lesser circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII16.html"},{"book":"12","number":"17","proposition":"Given two spheres about the same center, to inscribe in the greater sphere a polyhedral solid which does not touch the lesser sphere at its surface.\n\nCorollary to XII.17.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII17.html"},{"book":"12","number":"18","proposition":"Spheres are to one another in triplicate ratio of their respective diameters.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXII/propXII18.html"},{"book":"13","number":"1","proposition":"If a straight line is cut in extreme and mean ratio, then the square on the greater segment added to the half of the whole is five times the square on the half.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII1.html"},{"book":"13","number":"2","proposition":"If the square on a straight line is five times the square on a segment on it, then, when the double of the said segment is cut in extreme and mean ratio, the greater segment is the remaining part of the original straight line.\n\nLemma for XIII.2.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII2.html"},{"book":"13","number":"3","proposition":"If a straight line is cut in extreme and mean ratio, then the square on the sum of the lesser segment and the half of the greater segment is five times the square on the half of the greater segment.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII3.html"},{"book":"13","number":"4","proposition":"If a straight line is cut in extreme and mean ratio, then the sum of the squares on the whole and on the lesser segment is triple the square on the greater segment.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII4.html"},{"book":"13","number":"5","proposition":"If a straight line is cut in extreme and mean ratio, and a straight line equal to the greater segment is added to it, then the whole straight line has been cut in extreme and mean ratio, and the original straight line is the greater segment.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII5.html"},{"book":"13","number":"6","proposition":"If a rational straight line is cut in extreme and mean ratio, then each of the segments is the irrational straight line called apotome.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII6.html"},{"book":"13","number":"7","proposition":"If three angles of an equilateral pentagon, taken either in order or not in order, are equal, then the pentagon is equiangular.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII7.html"},{"book":"13","number":"8","proposition":"If in an equilateral and equiangular pentagon straight lines subtend two angles are taken in order, then they cut one another in extreme and mean ratio, and their greater segments equal the side of the pentagon.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII8.html"},{"book":"13","number":"9","proposition":"If the side of the hexagon and that of the decagon inscribed in the same circle are added together, then the whole straight line has been cut in extreme and mean ratio, and its greater segment is the side of the hexagon.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII9.html"},{"book":"13","number":"10","proposition":"If an equilateral pentagon is inscribed ina circle, then the square on the side of the pentagon equals the sum of the squares on the sides of the hexagon and the decagon inscribed in the same circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII10.html"},{"book":"13","number":"11","proposition":"If an equilateral pentagon is inscribed in a circle which has its diameter rational, then the side of the pentagon is the irrational straight line called minor.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII11.html"},{"book":"13","number":"12","proposition":"If an equilateral triangle is inscribed in a circle, then the square on the side of the triangle is triple the square on the radius of the circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII12.html"},{"book":"13","number":"13","proposition":"To construct a pyramid, to comprehend it in a given sphere; and to prove that the square on the diameter of the sphere is one and a half times the square on the side of the pyramid.\n\nLemma for XIII.13.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII13.html"},{"book":"13","number":"14","proposition":"To construct an octahedron and comprehend it in a sphere, as in the preceding case; and to prove that the square on the diameter of the sphere is double the square on the side of the octahedron.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII14.html"},{"book":"13","number":"15","proposition":"To construct a cube and comprehend it in a sphere, like the pyramid; and to prove that the square on the diameter of the sphere is triple the square on the side of the cube.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII15.html"},{"book":"13","number":"16","proposition":"To construct an icosahedron and comprehend it in a sphere, like the aforesaid figures; and to prove that the square on the side of the icosahedron is the irrational straight line called minor.\n\nCorollary. The square on the diameter of the sphere is five times the square on the radius of the circle from which the icosahedron has been described, and the diameter of the sphere is composed of the side of the hexagon and two of the sides of the decagon inscribed in the same circle.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII16.html"},{"book":"13","number":"17","proposition":"To construct a dodecahedron and comprehend it in a sphere, like the aforesaid figures; and to prove that the square on the side of the dodecahedron is the irrational straight line called apotome.\n\nCorollary. When the side of the cube is cut in extreme and mean ratio, the greater segment is the side of the dodecahedron.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII17.html"},{"book":"13","number":"18","proposition":"To set out the sides of the five figures and compare them with one another.","link":"https://mathcs.clarku.edu/~djoyce/elements/bookXIII/propXIII18.html"}]
}

